# Hide

## Description
Hides any visible or grayed objects matching the specified search criteria.

```pascal
PROCEDURE Hide(c : CRITERIA);
```

```python
def vs.Hide(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Remarks
Makes objects with the specified search criteria invisible if they are not already

## Examples
==== VectorScript ====
```pascal
Hide((C='Proposed Phase 2 Construction'));
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Criteria